WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_measure_freq.c
  // Get the current status to determine why ISR called
  uint16_t timStatusReg = getreg16(timerBase + STM32_GTIM_SR_OFFSET);
  // syslog(1, "Status Reg:0x%04x\n", timStatusReg);

  //----------------------------------------------------------
  // Check UIF (Update Interrupt Flag), which indicates CNT changed.
  if(timStatusReg & GTIM_SR_UIF)
  {
    timStatusReg &= ~GTIM_SR_UIF;

    // We need to account for the timer's CNT overflow and use it in the
    // individual input calculations.
    // Note: with a 96 MHz clock a 16-bit timer will rollover every 683
    // microseconds and at 960 kHz it will rollover every 68.3 milliseconds,
    // about 14.6 times/second. Tracking a 16-bit timers overflows will
    // overflow a 32-bit integer in
    // 4,294,967,296 / 14.6  =                                                             
    // A 4,294,967,296
    // 
    // A 32-bit timer at 96 MHz will rollover every
    // (--) THIS TEXT IS NOT COMPLETE!!! HOW OFTEN WILL A 48-BIT TIMER?
    // ??? seconds 823,263 seconds or every 9 days.
    // Ignoring rollover in following code.
    // This 32-bit number is used to effectively add 32-bits to the timer's
    // length.

    mdwFreqTimerInfo->timerOverflow++;
  }

  //----------------------------------------------------------
  // Channel 1
  if(timStatusReg & GTIM_SR_CC1IF)
  {
    bool inputState;
    uint64_t capturedCount;
    // (--) Diag
    stm32_gpiowrite(DEBUG_PIN_V2_D06, true);
    
    timStatusReg &= ~GTIM_SR_CC1IF;

    // Channel data pointer
    mdwFreqRtData_t *mdwFreqRtData = 
              mdwFreqTimerInfo->mdwFreqRtData[FREQ_RT_DATA_OFFSET_CHAN_1];
    if(mdwFreqRtData == NULL)
    {
      syslog(1, "%s@%d-Channel 1-mdwFreqRtData is NULL in ISR\n", __FILE__, __LINE__);
      return -ERROR;  // -1
    }

    // Read the current input GPIO state to determine raising or falling edge
    inputState = stm32_gpioread(mdwFreqRtData->inputConfig);

    // Reading the captured value will reset reg value to 0
    capturedCount = getreg32(timerBase + STM32_GTIM_CCR1_OFFSET);

    if(inputState)
    {
      // Raising edge is end of previous capture and the beginning of this
      // new capture
      mdwFreqRtData->bgnResltCnt  = mdwFreqRtData->endResltCnt;
      mdwFreqRtData->bgnResltOFlo = mdwFreqRtData->endResltOFlo;
      mdwFreqRtData->midResltCnt  = mdwFreqRtData->midCaptrCnt;
      mdwFreqRtData->midResltOFlo = mdwFreqRtData->midCaptrOFlo;
      // End is now
      mdwFreqRtData->endResltCnt  = capturedCount;
      mdwFreqRtData->endResltOFlo = mdwFreqTimerInfo->timerOverflow;

      // The following is for finding average frequency
      mdwFreqRtData->totalGpioPulses++;
    }
    else
    {
      // Falling edge
      mdwFreqRtData->midCaptrCnt  = capturedCount;
      mdwFreqRtData->midCaptrOFlo = mdwFreqTimerInfo->timerOverflow;
    }

    // (--) Diag
    stm32_gpiowrite(DEBUG_PIN_V2_D06, false);
  }

  //----------------------------------------------------------
  // Channel 2
  if(timStatusReg & GTIM_SR_CC2IF)
  {
    timStatusReg &= ~GTIM_SR_CC2IF;

  }

  //----------------------------------------------------------
  // Channel 3
  if(timStatusReg & GTIM_SR_CC3IF)
  {
    timStatusReg &= ~GTIM_SR_CC3IF;

  }

  //----------------------------------------------------------
  // Channel 4
  if(timStatusReg & GTIM_SR_CC4IF)
  {
    timStatusReg &= ~GTIM_SR_CC4IF;

  }

  // Clear the status register
  putreg16(0, timerBase + STM32_GTIM_SR_OFFSET);
  // putreg16(timStatusReg, timerBase + STM32_GTIM_SR_OFFSET);

  // (--) Diag
  stm32_gpiowrite(DEBUG_PIN_V2_D06, false);

  return OK;
}

//=============================================================
static uint32_t meadow_measure_freq_get_apb_clock(
          mdwFreqTimerInfo_t *mdwFreqTimerInfo)
{
  if(mdwFreqTimerInfo->timerAPBClk)
    return STM32_RCC_APB2ENR;
  else
    return STM32_RCC_APB1ENR;
}

//=============================================================
// Uses the bit-field to determine the Timer clock
static uint32_t meadow_measure_freq_get_max_clock(
          const mdwFreqTimerInfo_t *mdwFreqTimerInfo)
{
  if(mdwFreqTimerInfo->timerMaxClk)
    return STM32_APB2_TIM1_CLKIN;
  else
    return STM32_APB1_TIM2_CLKIN;
}

//=============================================================
static void meadow_measure_freq_disable(const uint32_t timerBase)
{
  uint16_t regval = getreg16(timerBase + STM32_BTIM_CR1_OFFSET);
  regval &= ~ATIM_CR1_CEN;
  putreg16(regval, timerBase + STM32_BTIM_CR1_OFFSET);
}

//=============================================================
static void meadow_measure_freq_enable(const uint32_t timerBase)
{
  // Enable timer Counter
  uint16_t cr1Val = getreg16(timerBase + STM32_GTIM_CR1_OFFSET);
  cr1Val |= GTIM_CR1_CEN;
  
  // Re-initialize the counter and generates an update of the registers
  uint16_t egrVal = getreg16(timerBase + STM32_GTIM_EGR_OFFSET);
  egrVal |= GTIM_EGR_UG;

  putreg16(egrVal, timerBase + STM32_GTIM_EGR_OFFSET);
  putreg16(cr1Val, timerBase + STM32_GTIM_CR1_OFFSET);
}

//=====================================================================
// The following finds the specified timer's built-in timer information.
static mdwFreqTimerInfo_t *meadow_measure_freq_chk_get_timer_info(
          const int timerNumb)
{
  mdwFreqTimerInfo_t *timerInfo = &(mdwFreqTimerInfoArray[timerNumb - 1]);

  if(timerInfo->timerUsable)
    return timerInfo;

  return NULL;
}

//=====================================================================
// Returns the correct bit field definition based on the channel
uint8_t meadow_measure_freq_get_chan_bit_set(const int timerChan)
{
  switch(timerChan)
  {
    case 1:
      return ACTIVE_CHAN_BITFIELD_1;
      break;
    case 2:
      return ACTIVE_CHAN_BITFIELD_2;
      break;
    case 3:
      return ACTIVE_CHAN_BITFIELD_3;
      break;
    case 4:
      return ACTIVE_CHAN_BITFIELD_4;
      break;
    default:
      return 0;
  }
}

//==================================================================
// Get the current time in nanoseconds
static uint64_t meadow_measure_freq_get_current_time(void)
{
  int ret;
  uint64_t returnTime;
  struct tm rtcTime;
  long nsecs;
  long prevNsecs;

  // This Nuttx function reads the date, time and sub-seconds from the MCU's
  // hardware into a struct tm. However, the STM32F77X Errata warns about a
  // possible problem in ES0334-Rev 9 2.12.1 related to the RTC calendar
  // register not locked properly. Therefore, we'll read nsec twice and
  // compare.
#ifdef CONFIG_STM32F7_HAVE_RTC_SUBSECONDS
do
  {
    ret = up_rtc_getdatetime_with_subseconds(&rtcTime, &prevNsecs);
    if(ret < 0)
    {
      return ret;
    }

    // Read a second time per Errata
    ret = up_rtc_getdatetime_with_subseconds(&rtcTime, &nsecs);
    if(ret < 0)
    {
      return ret;
    }

    // If they match we have good values
    if(prevNsecs == nsecs)
      break;
      
  } while (1);
#else
  // This function is used if no sub-seconds.
  ret = up_rtc_getdatetime(&rtcTime)
  nsecs = 0;
#endif

