WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_measure_freq.c
  // Lastly enable IRQ
  up_enable_irq(mdwFreqTimerInfo->timerIrqVec);

  return OK;
}

//=============================================================
// Called to unconfigure a timer
int meadow_measure_freq_unconfigure(const uint32_t timerNumber)
{
  // mdwFreqTimerInfo_t *mdwFreqTimerInfo =
  //           meadow_measure_freq_chk_get_timer_info(timerNumber);

  // // Is this slot being used?
  // if(mdwFreqTimerInfo->mdwFreqRtData == NULL)
  // {
  //   syslog(LOG_ERR, "%s@%d-Can't unconfigure, this timer %lu not configured.\n",
  //             __FILE__, __LINE__, timerNumber);
  //   return -EBADSLT;    // Invalid slot
  // }

  // // Stop interrupts
  // up_disable_irq(mdwFreqTimerInfo->timerIrqVec);

  // // Stop timer
  // meadow_measure_freq_disable(mdwFreqTimerInfo->timerBase);

  // // Unconfigure GPIO
  // stm32_unconfiggpio(mdwFreqTimerInfo->mdwFreqRtData->inputConfig);

  // // Free runtime memory
  // free(mdwFreqTimerInfo->mdwFreqRtData);
  // mdwFreqTimerInfo->mdwFreqRtData = NULL;
  return OK;
}

//================================================================
// Return Frequency and Duty Cycle information to caller.
// Moved as much processing here as apposed to the ISR.
int meadow_measure_freq_return_freq_info(mdwFreqReturnData_t
          *returnData)
{
  double dblFrequency;
  double dblAverageFreq;
  double dblDutyCycle;
  double dblTotalInputCount;
  uint64_t halfCycle;
  uint64_t fullCycle;
  uint64_t regOvrFloTimSize;
  uint64_t beginCaptrUi64;
  uint64_t midCaptrUi64;
  uint64_t endCaptrUi64;
  uint64_t endCaptureTime = meadow_measure_freq_get_current_time();

  // Just feed pulse train into appropriate GPIO
  mdwFreqTimerInfo_t *mdwFreqTimerInfo =
            meadow_measure_freq_chk_get_timer_info(returnData->timerNumber);
  if(mdwFreqTimerInfo == NULL)
  {
    syslog(LOG_ERR, "%s@%d-Couldn't get TimerInfo from timer number:%lu\n",
          __FILE__, __LINE__, returnData->timerNumber);
    return -1;
  }

  mdwFreqRtData_t *mdwFreqRtData =
            mdwFreqTimerInfo->mdwFreqRtData[returnData->timerChannel - 1];
  if(mdwFreqRtData == NULL)
  {
    syslog(1, "%s@%d-Unconfigured channel accessed\n", __FILE__, __LINE__);
    return -ERROR;  // -1
  }

  if(mdwFreqTimerInfo->timerWidth)
    regOvrFloTimSize = MEADOW_FREQ_32_BIT_OVERFLOW_COUNT;
  else
    regOvrFloTimSize = MEADOW_FREQ_16_BIT_OVERFLOW_COUNT;

  uint64_t ovrFloAtStart = mdwFreqRtData->bgnResltOFlo;

  // Add in the overflow counts
  beginCaptrUi64 = mdwFreqRtData->bgnResltCnt + ((mdwFreqRtData->bgnResltOFlo - ovrFloAtStart) * regOvrFloTimSize);
  midCaptrUi64   = mdwFreqRtData->midResltCnt + ((mdwFreqRtData->midResltOFlo - ovrFloAtStart) * regOvrFloTimSize);
  endCaptrUi64   = mdwFreqRtData->endResltCnt + ((mdwFreqRtData->endResltOFlo - ovrFloAtStart) * regOvrFloTimSize);

  // Use normalize the values, set begin at 0
  fullCycle = endCaptrUi64 - beginCaptrUi64;
  halfCycle = midCaptrUi64 - beginCaptrUi64;

  // To help preserve resolution, use floating point math.
  syslog(1, "%s@%d-Snapshot-full Count:%llu, half Count:%llu, inputTotal:%llu\n",
            __FILE__, __LINE__,
            fullCycle, halfCycle,
            mdwFreqRtData->totalGpioPulses);

  // Duty Cycle is the ratio of the full cycle count and the cycle count
  // before the trailing edge was detected.
  dblDutyCycle = (((double)halfCycle) * 100.0) / ((double)fullCycle);

  // The dblFrequency is the timer's clock divided by the cycle count.
  dblFrequency = ((double)MEADOW_FREQ_CLOCK_FREQ) / ((double)fullCycle);

  // Average frequency since last read calculations
  uint64_t totalCaptureTime = endCaptureTime - startCaptureTime;
  // Convert nanoseconds to fractional seconds
  double dblTotalCaptureTime = ((double) totalCaptureTime) / (1000.0 * 1000.0 * 1000.0);
  dblTotalInputCount = (double)mdwFreqRtData->totalGpioPulses;
  dblAverageFreq = ((double)dblTotalInputCount) / dblTotalCaptureTime;

  syslog(2, "AvgFreq:%6.2f, Since last read, GpioCnt:%llu\n",
            dblAverageFreq,
            mdwFreqRtData->totalGpioPulses);

  syslog(2, "In Code-Freq:%06.2fHz, DC:%02.2f%%, AvgFreq:%06.8f, Count:%lu\n",
            dblFrequency, dblDutyCycle, dblAverageFreq,
            (uint32_t)dblTotalInputCount);

  returnData->frequencyX1000  = (dblFrequency * 1000.0);
  returnData->dutyCycleX1000  = (dblDutyCycle * 1000.0);
  returnData->avgFreqX1000    = (dblAverageFreq * 1000.0);
  returnData->totalGpioPulses = (uint32_t)dblTotalInputCount;

  // Reset capture counts for new average calc
  mdwFreqRtData->totalGpioPulses = 0;
  startCaptureTime = meadow_measure_freq_get_current_time();

  return OK;
}
#endif    // #if defined(MEADOW_INCLUDE_CALC_FREQ_DC_IN_BUILD)
